/* 
1. Callback & Higher-Order Function มีข้อดีอย่างไร
Answer: callback ช่วยให้โค้ดมีความยืดหยุ่นมากขึ้น และทำให้สามารถนำโค้ดมาใช้ร่วมกันเพื่อให้ได้งานที่ซับซ้อนขึ้น
ส่วน Higher-Order Function ช่วยให้ใช้อย่างโค้ดมีความยืดหยุ่นมากขึ้น 


2. จากการลองใช้ Callback Function ในระบบเกมและระบบแจ้งเตือน คุณคิดว่าโค้ดอ่านง่ายขึ้นหรือไม่ เพราะอะไร 
Answer:ง่ายขึ้นเพราะมีตัวอย่างชัดเจนและเริ่มที่จะเข้าใจมากขึ้น


3. หากต้องสอนเพื่อนให้เข้าใจ callback & Higher-Order Function ใน 5 นาที จะอธิบายอย่างไร 
Answer:  callback คือ ทำเป็นของกลางให้ตัวอื่นเรียกใช้ได้ โยงเยอะนิดนึงอาจจะงงได้
Higher-Order Function คือ ใช้หลายตัวพร้อมกัน ถ


*/